<a href="https://colab.research.google.com/github/ccwu0918/book-sqlfifty/blob/main/appx01-schema/appx01-schema.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL 的五十道練習：初學者友善的資料庫入門

> 附錄一：學習資料庫綱要

In [ ]:
!pip install SQLAlchemy==1.4.46

In [ ]:
!git clone https://github.com/datainpoint/book-sqlfifty

Cloning into 'book-sqlfifty'...
remote: Enumerating objects: 186, done.
remote: Counting objects: 100% (186/186), done.
remote: Compressing objects: 100% (122/122), done.
remote: Total 186 (delta 54), reused 173 (delta 44), pack-reused 0
Receiving objects: 100% (186/186), 28.90 MiB | 5.50 MiB/s, done.
Resolving deltas: 100% (54/54), done.

In [ ]:
%cd book-sqlfifty

/content/book-sqlfifty

In [ ]:
# %%capture
%load_ext sql

In [ ]:
import sqlite3

conn = sqlite3.connect('../databases/imdb.db')

cur = conn.cursor()
cur.execute("SELECT * FROM sqlite_master WHERE type='table'")

rows = cur.fetchall()
for row in rows:
    print(row)
conn.close()

('table', 'movies', 'movies', 41, 'CREATE TABLE movies (\n    id INTEGER,\n    title TEXT,\n    release_year INTEGER,\n    rating REAL,\n    director TEXT,\n    runtime int,\n    PRIMARY KEY (id)\n)')
('table', 'actors', 'actors', 46, 'CREATE TABLE actors (\n    id INTEGER,\n    name TEXT,\n    PRIMARY KEY (id)\n)')
('table', 'casting', 'casting', 64, 'CREATE TABLE casting (\n    movie_id INTEGER,\n    actor_id INTEGER,\n    ord INTEGER,\n    FOREIGN KEY (movie_id) REFERENCES movies (id) \n            ON DELETE CASCADE ON UPDATE NO ACTION\n    FOREIGN KEY (actor_id) REFERENCES actors (id) \n            ON DELETE CASCADE ON UPDATE NO ACTION\n)')

In [ ]:
%sql sqlite:///databases/imdb.db

'Connected: @databases/imdb.db'

In [ ]:
# %LOAD sqlite3 db=../databases/imdb.db timeout=2 shared_cache=true

In [ ]:
%%sql
ATTACH "./databases/nba.db" AS nba;
ATTACH "./databases/twElection2020.db" AS twElection2020;
ATTACH "./databases/covid19.db" AS covid19;

## 學習資料庫 `covid19`

![](https://github.com/ccwu0918/book-sqlfifty/blob/main/images/covid19-erd.png?raw=1)

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('daily_report')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('Combined_Key', 'TEXT', 1),
 ('Confirmed', 'INTEGER', 0),
 ('Deaths', 'INTEGER', 0),
 ('Last_Update', 'TEXT', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('lookup_table')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('Admin2', 'TEXT', 0),
 ('Combined_Key', 'TEXT', 0),
 ('Country_Region', 'TEXT', 0),
 ('Lat', 'REAL', 0),
 ('Long_', 'REAL', 0),
 ('Population', 'INTEGER', 0),
 ('Province_State', 'TEXT', 0),
 ('UID', 'INTEGER', 1),
 ('iso2', 'TEXT', 0),
 ('iso3', 'TEXT', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('time_series')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('Confirmed', 'INTEGER', 0),
 ('Country_Region', 'TEXT', 2),
 ('Daily_Cases', 'INTEGER', 0),
 ('Daily_Deaths', 'INTEGER', 0),
 ('Date', 'TEXT', 1),
 ('Deaths', 'INTEGER', 0)]

## 學習資料庫 `imdb`

![](https://github.com/ccwu0918/book-sqlfifty/blob/main/images/imdb-erd.png?raw=1)

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('actors')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('id', 'INTEGER', 1), ('name', 'TEXT', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('casting')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('actor_id', 'INTEGER', 0), ('movie_id', 'INTEGER', 0), ('ord', 'INTEGER', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('movies')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('director', 'TEXT', 0),
 ('id', 'INTEGER', 1),
 ('rating', 'REAL', 0),
 ('release_year', 'INTEGER', 0),
 ('runtime', 'int', 0),
 ('title', 'TEXT', 0)]

## 學習資料庫 `nba`

![](https://github.com/ccwu0918/book-sqlfifty/blob/main/images/nba-erd.png?raw=1)

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('career_summaries')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('apg', 'REAL', 0),
 ('assists', 'INTEGER', 0),
 ('blocks', 'INTEGER', 0),
 ('bpg', 'REAL', 0),
 ('dd2', 'INTEGER', 0),
 ('defReb', 'INTEGER', 0),
 ('fga', 'INTEGER', 0),
 ('fgm', 'INTEGER', 0),
 ('fgp', 'REAL', 0),
 ('fta', 'INTEGER', 0),
 ('ftm', 'INTEGER', 0),
 ('ftp', 'REAL', 0),
 ('gamesPlayed', 'INTEGER', 0),
 ('gamesStarted', 'INTEGER', 0),
 ('min', 'INTEGER', 0),
 ('mpg', 'REAL', 0),
 ('offReb', 'INTEGER', 0),
 ('pFouls', 'INTEGER', 0),
 ('personId', 'INTEGER', 1),
 ('plusMinus', 'INTEGER', 0),
 ('points', 'INTEGER', 0),
 ('ppg', 'REAL', 0),
 ('rpg', 'REAL', 0),
 ('spg', 'REAL', 0),
 ('steals', 'INTEGER', 0),
 ('td3', 'INTEGER', 0),
 ('totReb', 'INTEGER', 0),
 ('tpa', 'INTEGER', 0),
 ('tpm', 'INTEGER', 0),
 ('tpp', 'REAL', 0),
 ('turnovers', 'INTEGER', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('players')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('collegeName', 'TEXT', 0),
 ('country', 'TEXT', 0),
 ('dateOfBirthUTC', 'TEXT', 0),
 ('firstName', 'TEXT', 0),
 ('heightFeet', 'INTEGER', 0),
 ('heightInches', 'INTEGER', 0),
 ('heightMeters', 'REAL', 0),
 ('jersey', 'INTEGER', 0),
 ('lastAffiliation', 'TEXT', 0),
 ('lastName', 'TEXT', 0),
 ('nbaDebutYear', 'INTEGER', 0),
 ('personId', 'INTEGER', 1),
 ('pos', 'TEXT', 0),
 ('teamId', 'INTEGER', 0),
 ('temporaryDisplayName', 'TEXT', 0),
 ('weightKilograms', 'REAL', 0),
 ('weightPounds', 'REAL', 0),
 ('yearsPro', 'INTEGER', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('teams')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('altCityName', 'TEXT', 0),
 ('city', 'TEXT', 0),
 ('confName', 'TEXT', 0),
 ('divName', 'TEXT', 0),
 ('fullName', 'TEXT', 0),
 ('isAllStar', 'TEXT', 0),
 ('isNBAFranchise', 'TEXT', 0),
 ('nickname', 'TEXT', 0),
 ('teamId', 'INTEGER', 1),
 ('teamShortName', 'TEXT', 0),
 ('tricode', 'TEXT', 0),
 ('urlName', 'TEXT', 0)]

## 學習資料庫 `twElection2020`

![](https://github.com/ccwu0918/book-sqlfifty/blob/main/images/twElection2020-erd.png?raw=1)

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('admin_regions')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('county', 'TEXT', 0),
 ('id', 'INTEGER', 1),
 ('town', 'TEXT', 0),
 ('village', 'TEXT', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('candidates');

 * sqlite:///databases/imdb.db
Done.

[('id', 'INTEGER', 1),
 ('party_id', 'INTEGER', 0),
 ('type', 'TEXT', 0),
 ('number', 'INTEGER', 0),
 ('candidate', 'TEXT', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('legislative_at_large')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('admin_region_id', 'INTEGER', 0),
 ('office', 'INTEGER', 0),
 ('party_id', 'INTEGER', 0),
 ('votes', 'INTEGER', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('legislative_regional')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('admin_region_id', 'INTEGER', 0),
 ('candidate_id', 'INTEGER', 0),
 ('electoral_district', 'TEXT', 0),
 ('office', 'INTEGER', 0),
 ('votes', 'INTEGER', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('parties')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('id', 'INTEGER', 1), ('party', 'TEXT', 0)]

In [ ]:
%%sql
SELECT name,
    type,
    pk
FROM PRAGMA_TABLE_INFO('presidential')
ORDER BY name;

 * sqlite:///databases/imdb.db
Done.

[('admin_region_id', 'INTEGER', 0),
 ('candidate_id', 'INTEGER', 0),
 ('office', 'INTEGER', 0),
 ('votes', 'INTEGER', 0)]